[
    {
        "date": "2025-12-03",
        "date_display": "December 3, 2025",
        "speaker": "Saji Uncle",
        "members": "Evan, Christy, Noyal, Nevin, Joel, Varghese uncle",
        "portion": "John 5:1–15",
        "title": "Not being a witness of Jesus in Campus is a Sin",
        "summary": "**The Event: Healing at Bethesda**\n **Context:** Occurred during a feast near the Sheep Gate pool.\n **The Miracle:** Jesus singled out an invalid of 38 years. The man focused on his problems, but Jesus healed him immediately.\n\n**The Aftermath & Warning**\n **Reunion:** Jesus found him later and warned, “Stop sinning or something worse may happen to you.”\n **Action:** The man revealed Jesus to the Jews despite the potential danger.\n\n**Key Spiritual Application**\n **God’s Choice:** Just as Jesus found one person in a “stinking place,” God has chosen us from the multitude.\n **The Definition of Sin:** Failing to be a true witness for Christ.\n **Call to Action:** Our specific duty is to witness in our campus. Silence is viewed here as a sin."
    },
    {
        "date": "2025-11-26",
        "date_display": "November 26, 2025",
        "speaker": "Bibin",
        "members": "Evan, Jonathan, Chris, Christy, Bibin, Jeyaraj",
        "portion": "John 17:1–5",
        "title": "The Prayer of Jesus",
        "summary": "1. **Dependence on God:** Jesus looked up to the Father in prayer. We must look to God first in every situation instead of relying on ourselves.\n\n2. **Trusting God’s Timing:** Jesus accepted that “The hour has come.” We must trust God’s timing in challenges and surrender our plans.\n\n3. **God’s Glory:** He asked to be glorified to glorify the Father. Our lives should point others to God, not our own achievements.\n\n4. **Eternal Life is Relationship:** Eternal life is defined as knowing God and Christ. We are encouraged to deepen our daily walk with God personally.\n\n5. **Faithfulness:** Jesus completed the work given to Him. We are reminded to be faithful in our responsibilities, knowing God sees our efforts."
    },
    {
        "date": "2025-11-19",
        "date_display": "November 19, 2025",
        "speaker": "Thomas Antony Uncle",
        "members": "Evan, Jonathon, Chris, Noyal, Joel, Jeyaraj, Jane",
        "portion": "Galatians 4:17–20",
        "title": "The Goal - Christ Formed in Us",
        "summary": "1. False Zeal vs. True Purpose\n\n**The Agitators (“They”):** The false teachers (connected to Gal. 3:1) are trying to pull you away from Paul so you become dependent on them. Their motives are self-centered, not godly.\n\n**Proper Zeal:** Zeal is good—but only when the purpose is good. True spiritual passion should be consistent, not something that only appears when spiritual leaders like Paul are present.\n\n\n2. The Goal: Christ Formed in Us\n\n**Sanctification:** Receiving Jesus is just the beginning. The lifelong journey is Sanctification—the process of becoming more like Jesus until “Christ is fully formed in you.”\n\n**The Blueprint (Romans 8:28–29):** God’s ultimate purpose is that we be conformed to the image of His Son. This shaping continues throughout our entire life.\n\n\n3. How We Grow (The Process)\n\n**Personal Relationship:** True growth requires more than reading Scripture. We must meditate on it (Psalm 1) and let the Holy Spirit apply the Word to our hearts.\n\n**Self-Reflection:** Growth requires honest questions: Is my growth stunted? Am I still maturing spiritually?\n\n\n4. Concern for Others\n\nJust as Paul labored and felt deep concern for the Galatians, we should also desire that Christ is formed in others. Spiritual maturity means moving beyond self-focus toward encouraging, strengthening, and caring for the growth of those around us."
    },
    {
        "date": "2025-12-07",
        "date_display": "December 07, 2025",
        "speaker": "test by jokku",
        "portion": "test1",
        "title": "test1",
        "summary": "test1",
        "members": "test1"
    }
]